<div style="background: #000;
            color: #FFF;
            margin: 0px;
                padding: 10px 0px 20px 0px;
            text-align: center; 
                ">
    <h1>Week 9 - Lab 1</h1>
</div>

# Exercise 1

Follow the instruction given and install the Pandas Library in VS Code. After installation, input a picture to document that you have successfully installed the Pandas Library.

https://pypi.org/project/pandas/

In a New Terminal: Should be pypi:
    
    pip install pandas 

If you have the latest version of python:

    pip3 install pandas 

Once you have the library create a simple dataframe of your choosing. Show your code.

<img src='src1.jpg'>

In [3]:
import pandas as pd
# initialize list of lists
data = [['Mus lolo', 99], ['nick Naji', 98], ['Joulia Boto', 99]]
  
# Create the pandas DataFrame
df = pd.DataFrame(data, columns = ['Name of students', 'Grades'])
  
# print dataframe.
df

  Name of students  Grades
0         Mus lolo      99
1        nick Naji      98
2      Joulia Boto      99

# Exercise 2

Create a data frame using pandas that uses a conditional statement other than if ascending = false.

In [13]:
data = [[12321, 'Mus lolo', 99], [3453, 'nick Naji', 98], [756756, 'Joulia Boto', 99]]
df = pd.DataFrame(data, columns = ["Student's id",'Name of students', 'Grades'])
df.sort_values(by=['Grades'], kind='quicksort')

   Student's id Name of students  Grades
1          3453        nick Naji      98
0         12321         Mus lolo      99
2        756756      Joulia Boto      99

# Exercise 3

Create a Data Frame using pandas with Names and Age and change the datatype of age from int to str.

In [18]:
data={
    'Names':['Nano','Ki', 'Kolo','Mus'],
    'Age':[45,34,33,12]     
}
df = pd.DataFrame(data, columns = ['Names','Age'])
df

  Names  Age
0  Nano   45
1    Ki   34
2  Kolo   33
3   Mus   12

In [19]:
df.dtypes

Names    object
Age       int64
dtype: object

In [20]:
df['Age'] = df['Age'].values.astype(str)
df.dtypes

Names    object
Age      object
dtype: object

# Exercise 4

Write a data frame using pandas that contains a dictionary of column1 of 5 strings of letters, a column2 of 5 integers, another column3 of 5 integers and a column4 of 5 strings of letters with lower and upper cases.

In [32]:
data={
    'Column_1':['f','p','r','y','q'],
    'Column_2':[12,14,11,44,23],
    'Column_3':[21,22,23,41,51],
    'column_4':['L','P','a','k','O']
}
df=pd.DataFrame.from_dict(data)
df

  Column_1  Column_2  Column_3 column_4
0        f        12        21        L
1        p        14        22        P
2        r        11        23        a
3        y        44        41        k
4        q        23        51        O

In [33]:
df.style.hide_index()

# Bonus Question

Write a Pandas program that contains data of a student for each column (you can create as many as you think are necessary). Make sure to display the default index and set a column as an Index in the dataframe. Output only one of the columns of your choice and change its datatype.

In [34]:
data ={
      'Student_id':[234,54,654,744],
      'Student_name':['Iko','Loka','Poly','Bbc'],
      'Student_major':['LBS','CST','CST','ARB'],
      'Student_GPA':['4.4','3.6','2.3','3.5']
}
df=pd.DataFrame.from_dict(data)
df

   Student_id Student_name Student_major Student_GPA
0         234          Iko           LBS         4.4
1          54         Loka           CST         3.6
2         654         Poly           CST         2.3
3         744          Bbc           ARB         3.5

In [35]:
df.dtypes

Student_id        int64
Student_name     object
Student_major    object
Student_GPA      object
dtype: object

In [36]:
#Converting Student_GPA to float 
df['Student_GPA']=df['Student_GPA'].astype(float)
df.dtypes

Student_id         int64
Student_name      object
Student_major     object
Student_GPA      float64
dtype: object